[
    {
      "date": "0070-01-01T00:00:00",
      "claimants": "Simon bar Giora, Jewish Essenes",
      "description": "The Jewish Essene sect of ascetics saw the Jewish uprising against the Romans in 66–70 in Judea as the final end-time battle which would bring about the arrival of the Messiah. By the authority of Simon, coins were minted declaring the redemption of Israel."
    },
    {
      "date": "0365-01-01T00:00:00",
      "claimants": "Hilary of Poitiers",
      "description": "This French bishop announced the end of the world would happen during this year."
    },
    {
      "date": "0400-01-01T00:00:00",
      "claimants": "Martin of Tours",
      "description": "This French bishop stated that the world would end before 400 AD, writing, \u0022There is no doubt that the Antichrist has already been born. Firmly established already in his early years, he will, after reaching maturity, achieve supreme power.\u0022"
    },
    {
      "date": "0500-01-01T00:00:00",
      "claimants": "Hippolytus of Rome, Sextus Julius Africanus, Irenaeus",
      "description": "All three predicted Jesus would return in this year, with one of the predictions being based on the dimensions of Noah\u0027s Ark."
    },
    {
      "date": "0793-04-06T00:00:00",
      "claimants": "Beatus of Liébana",
      "description": "This Spanish monk prophesied the Second Coming of Christ and the end of the world on that day in front of a large crowd of people."
    },
    {
      "date": "0800-01-01T00:00:00",
      "claimants": "Sextus Julius Africanus",
      "description": "This Christian historian revised his prediction from the year 500 to 800."
    },
    {
      "date": "0806-01-01T00:00:00",
      "claimants": "Gregory of Tours",
      "description": "This French bishop calculated the end would occur between 799 and 806."
    },
    {
      "date": "0847-01-01T00:00:00",
      "claimants": "Thiota",
      "description": "This Christian declared in 847 that the world would end that year, though later confessed the prediction was fraudulent and was publicly flogged."
    },
    {
      "date": "0995-01-01T00:00:00",
      "claimants": "Various Christians",
      "description": "Good Friday coincided with the Feast of the Annunciation; this had long been believed to be the event that would bring forth the Antichrist, and thus the end-times, within three years."
    },
    {
      "date": "1000-01-01T00:00:00",
      "claimants": "Pope Sylvester II",
      "description": "Various Christian clerics predicted this date as the Millennium, including Pope Sylvester II. As a result, riots are said to have occurred in Europe and pilgrims headed east to Jerusalem. Many historians, however, dispute that any of these events ever took place."
    },
    {
      "date": "1033-01-01T00:00:00",
      "claimants": "Various Christians",
      "description": "Following the failure of the 1 January 1000, prediction, some theorists proposed that the end would occur 1,000 years after Jesus\u0027 death, instead of his birth."
    },
    {
      "date": "1260-01-01T00:00:00",
      "claimants": "Joachim of Fiore",
      "description": "This Italian mystic determined that the Millennium would begin between 1200 and 1260."
    },
    {
      "date": "1284-01-01T00:00:00",
      "claimants": "Pope\u0026nbsp;Innocent\u0026nbsp;III",
      "description": "Pope Innocent III (died 1216) predicted that the world would end 666 years after the rise of Islam."
    },
    {
      "date": "1290-01-01T00:00:00",
      "claimants": "Joachimites",
      "description": "After his 1260 prediction failed, the followers of Joachim of Fiore rescheduled the end of the world to 1290 and then again to 1335."
    },
    {
      "date": "1335-01-01T00:00:00",
      "claimants": "Joachimites",
      "description": "After his 1260 prediction failed, the followers of Joachim of Fiore rescheduled the end of the world to 1290 and then again to 1335."
    },
    {
      "date": "1351-01-01T00:00:00",
      "claimants": "Various Europeans",
      "description": "The black plague spreading across Europe was interpreted by many as the sign of the end of times."
    },
    {
      "date": "1370-01-01T00:00:00",
      "claimants": "Jean de Roquetaillade",
      "description": "This French alchemist predicted the Antichrist was to come in 1366 and the Millennium would begin either in 1368 or 1370."
    },
    {
      "date": "1378-01-01T00:00:00",
      "claimants": "Arnaldus\u0026nbsp;de\u0026nbsp;Villa\u0026nbsp;Nova",
      "description": "This Joachite wrote that the Antichrist was to come during this year."
    },
    {
      "date": "1492-01-01T00:00:00",
      "claimants": "Various Russian Christians",
      "description": "Many Russian Orthodox Christians beginning from the 1400s believed this year would see Christ\u0027s return, since it would be the end of the seventh millennium and the start of the eighth millennium (the year 8000) according to the Byzantine calendar. In 1408, this belief led to the Russian Orthodox Church making the decision not to compute the date of Easter beyond 1491."
    },
    {
      "date": "1504-01-01T00:00:00",
      "claimants": "Sandro Botticelli",
      "description": "This painter believed he was living during the Tribulation, and that the Millennium would begin in three and a half years from 1500. He wrote into his painting The Mystical Nativity that the Devil was loose and would soon be chained."
    },
    {
      "date": "1524-02-01T00:00:00",
      "claimants": "London astrologers",
      "description": "A group of astrologers in London predicted the world would end by a flood starting in London, based on calculations made the previous June. Twenty thousand Londoners left their homes and headed for higher ground in anticipation."
    },
    {
      "date": "1524-02-20T00:00:00",
      "claimants": "Johannes\u0026nbsp;Stöffler",
      "description": "A planetary alignment in Pisces was seen by this astrologer as a sign of the Millennium."
    },
    {
      "date": "1526-01-01T00:00:00",
      "claimants": "Thomas Müntzer",
      "description": "1525 would mark the beginning of the Millennium, according to this Anabaptist. His followers were killed by cannon fire in an uneven battle with government troops. He died under torture and was beheaded."
    },
    {
      "date": "1528-05-27T00:00:00",
      "claimants": "Hans Hut",
      "description": "This German Anabaptist predicted the end would occur on this date."
    },
    {
      "date": "1528-01-01T00:00:00",
      "claimants": "Johannes Stöffler",
      "description": "A revised date from Stöffler after his 1524 prediction failed to come true."
    },
    {
      "date": "1533-10-19T00:00:00",
      "claimants": "Michael Stifel",
      "description": "This mathematician calculated that Judgement Day would begin at 8:00\u0026nbsp;am on this day."
    },
    {
      "date": "1533-01-01T00:00:00",
      "claimants": "Melchior Hoffman",
      "description": "This Anabaptist prophet predicted Christ\u0027s Second Coming to take place this year in Strasbourg. He claimed that 144,000 people would be saved, while the rest of the world would be consumed by fire."
    },
    {
      "date": "1534-04-05T00:00:00",
      "claimants": "Jan Matthys",
      "description": "During the Münster rebellion, this Anabaptist leader declared that the apocalypse would take place on this day. When the day came he led a failed attack against Franz von Waldeck and was decapitated."
    },
    {
      "date": "1555-01-01T00:00:00",
      "claimants": "Pierre d\u0027Ailly",
      "description": "Around 1400, this French theologian wrote that 6845 years of human history had already passed, and the end of the world would be in the 7000th year."
    },
    {
      "date": "1585-01-01T00:00:00",
      "claimants": "Michael Servetus",
      "description": "In his book The Restoration of Christianity, the Spanish born reformer claimed that the Devil\u0027s reign in this world had started in 325 AD, at the Council of Nicea, and would last for 1260 years, thus ending in 1585."
    },
    {
      "date": "1588-01-01T00:00:00",
      "claimants": "Regiomontanus",
      "description": "This mathematician and astronomer predicted the end of the world during this year."
    },
    {
      "date": "1600-01-01T00:00:00",
      "claimants": "Martin Luther",
      "description": "Luther, a German priest and professor of theology, predicted the end of the world would occur no later than 1600."
    },
    {
      "date": "1624-02-01T00:00:00",
      "claimants": "London astrologers",
      "description": "The same astrologers who had predicted the deluge of 1\u0026nbsp;February 1524 recalculated the date to 100 years later after their first prophecy failed."
    },
    {
      "date": "1648-01-01T00:00:00",
      "claimants": "Sabbatai Zevi",
      "description": "Using the kabbalah, this rabbi from Turkey proclaimed that the Messiah would come during that year."
    },
    {
      "date": "1651-01-01T00:00:00",
      "claimants": "Unknown author from Lübeck, Germany",
      "description": "The apocalypse maps tell of an Antichrist, the rise of Islam and other events following Judgement Day that was predicted to occur in 1651."
    },
    {
      "date": "1654-01-01T00:00:00",
      "claimants": "Helisaeus Roeslin",
      "description": "This physician made a prediction that the world would end this year based on a nova that occurred in 1572."
    },
    {
      "date": "1656-01-01T00:00:00",
      "claimants": "Christopher Columbus",
      "description": "In his Book of Prophecies (1501), Columbus predicted that the world would end during this year."
    },
    {
      "date": "1657-01-01T00:00:00",
      "claimants": "Fifth Monarchists",
      "description": "This group of radical Christians predicted that the final apocalyptic battle and the destruction of the Antichrist were to take place between 1655 and 1657."
    },
    {
      "date": "1658-01-01T00:00:00",
      "claimants": "Christopher Columbus",
      "description": "Columbus claimed that the world was created in 5343 BCE and would last 7,000 years. Assuming no year zero, that means the end would come in 1658."
    },
    {
      "date": "1660-01-01T00:00:00",
      "claimants": "Joseph Mede",
      "description": "Mede claimed that the Antichrist had appeared in 456, and the end would come in 1660."
    },
    {
      "date": "1666-01-01T00:00:00",
      "claimants": "Sabbatai Zevi",
      "description": "Following his failed prediction of 1648, Zevi recalculated the end of the Earth for this year."
    },
    {
      "date": "1666-01-01T00:00:00",
      "claimants": "Fifth Monarchists",
      "description": "The presence of 666 in the date, the death of 100,000 Londoners to bubonic plague, and the Great Fire of London led to superstitious fears of the end of the world from some Christians."
    },
    {
      "date": "1673-01-01T00:00:00",
      "claimants": "William Aspinwall",
      "description": "This Fifth Monarchist claimed the Millennium would begin by this year."
    },
    {
      "date": "1688-01-01T00:00:00",
      "claimants": "John Napier",
      "description": "This mathematician calculated the end of the world would be on this year based on calculations from the Book of Revelation."
    },
    {
      "date": "1689-01-01T00:00:00",
      "claimants": "Pierre Jurieu",
      "description": "This prophet predicted that Judgement Day would occur this year."
    },
    {
      "date": "1694-01-01T00:00:00",
      "claimants": "John Mason",
      "description": "This Anglican priest predicted the Millennium would begin by this year."
    },
    {
      "date": "1694-01-01T00:00:00",
      "claimants": "Johann Heinrich Alsted",
      "description": "This Calvinist minister predicted the Millennium would begin by this year."
    },
    {
      "date": "1694-01-01T00:00:00",
      "claimants": "Johann Jacob Zimmermann",
      "description": "Believed that Jesus would return and the world would end this year."
    },
    {
      "date": "1697-01-01T00:00:00",
      "claimants": "Cotton Mather",
      "description": "This Puritan minister predicted the world would end this year. After the prediction failed, he revised the date of the end two more times."
    },
    {
      "date": "1700-01-01T00:00:00",
      "claimants": "John Napier",
      "description": "Following his 1688 prediction, Napier recalculated his end of the world prediction to 1700 in A Plaine Discovery, a book published in 1593."
    },
    {
      "date": "1700-01-01T00:00:00",
      "claimants": "Henry Archer",
      "description": "In his 1642 work, The Personall Reigne of Christ Upon Earth, Archer predicted the Second Coming of Jesus would occur in approximately this year."
    },
    {
      "date": "1708-01-01T00:00:00",
      "claimants": "Camisards",
      "description": "Camisard prophets predicted the end of the world would occur in either 1705, 1706 or 1708."
    },
    {
      "date": "1716-01-01T00:00:00",
      "claimants": "Cotton Mather",
      "description": "Revised prediction from Mather after his 1697 prediction failed to come true."
    },
    {
      "date": "1719-04-05T00:00:00",
      "claimants": "Jacob Bernoulli",
      "description": "This mathematician predicted a comet would destroy the Earth on this day."
    },
    {
      "date": "1734-01-01T00:00:00",
      "claimants": "Nicholas of Cusa",
      "description": "This cardinal predicted the end would occur between 1700 and 1734."
    },
    {
      "date": "1736-10-16T00:00:00",
      "claimants": "William Whiston",
      "description": "This theologian predicted a comet colliding with the Earth this year."
    },
    {
      "date": "1736-01-01T00:00:00",
      "claimants": "Cotton Mather",
      "description": "Mather\u0027s third and final prediction for the end of the world."
    },
    {
      "date": "1757-01-01T00:00:00",
      "claimants": "Emanuel Swedenborg",
      "description": "Swedenborg, a  Lutheran theologian, claimed that the Last Judgement occurred in the spiritual world this year."
    },
    {
      "date": "1780-05-19T00:00:00",
      "claimants": "Connecticut General Assembly members, New Englanders",
      "description": "The sky turning dark during the day was interpreted as a sign of the end times. The primary cause of the event is believed to have been a combination of smoke from forest fires, a thick fog, and cloud cover."
    },
    {
      "date": "1789-01-01T00:00:00",
      "claimants": "Pierre d\u0027Ailly",
      "description": "The year 1789 would bring the coming of the Antichrist, according to this 14th-century cardinal."
    },
    {
      "date": "1792-01-01T00:00:00",
      "claimants": "Shakers",
      "description": "The Shakers, a Christian sect founded in 18th-century England, predicted the world would end in 1792 and then in 1794."
    },
    {
      "date": "1794-01-01T00:00:00",
      "claimants": "Shakers",
      "description": "The Shakers, a Christian sect founded in 18th-century England, predicted the world would end in 1792 and then in 1794."
    },
    {
      "date": "1795-11-19T00:00:00",
      "claimants": "Nathaniel Brassey Halhed",
      "description": "While campaigning for Richard Brothers\u0027 release, Halhead proclaimed that the world would end on this day."
    },
    {
      "date": "1795-01-01T00:00:00",
      "claimants": "Richard Brothers",
      "description": "This retired sailor stated the Millennium would begin between 1793 and 1795. He was eventually committed to an insane asylum."
    },
    {
      "date": "1805-01-01T00:00:00",
      "claimants": "Christopher Love",
      "description": "This Presbyterian minister predicted the destruction of the world by earthquake in 1805, followed by an age of everlasting peace when God would be known by all."
    },
    {
      "date": "1806-01-01T00:00:00",
      "claimants": "Mary Bateman",
      "description": "In Leeds, England, in 1806 a hen began laying eggs on which the phrase \u0022Christ is coming\u0022 was written. Eventually it was discovered to be a hoax. The owner, Mary Bateman, had written on the eggs in a corrosive ink so as to etch the eggs, and reinserted the eggs back into the hen\u0027s oviduct."
    },
    {
      "date": "1814-10-19T00:00:00",
      "claimants": "Joanna Southcott",
      "description": "This 64-year-old self-described prophet claimed she was pregnant with the Christ child, and that he would be born on 19\u0026nbsp;October 1814. She died later that year having not delivered a child, and an autopsy proved she had not been pregnant."
    },
    {
      "date": "0013-01-01T00:00:00",
      "claimants": "Various",
      "description": "During a large Leonids meteor shower, several people including Joseph Smith believed that it was a sign of Jesus\u0027 second coming."
    },
    {
      "date": "1833-01-01T00:00:00",
      "claimants": "Various",
      "description": "During a large Leonids meteor shower, several people including Joseph Smith believed that it was a sign of Jesus\u0027 second coming."
    },
    {
      "date": "1836-01-01T00:00:00",
      "claimants": "Johann Albrecht Bengel",
      "description": "In the 1730s this Lutheran clergyman proclaimed that Judgment Day would come in 1836, with the pope as the anti-Christ and the Freemasons representing the \u0022false prophet\u0022 of Revelations."
    },
    {
      "date": "1836-01-01T00:00:00",
      "claimants": "John Wesley",
      "description": "Wesley, the founder of the Methodist Church, foresaw the Millennium beginning this year. He wrote that Revelation 12:14 referred to 1058 to 1836, \u0022when Christ should come\u0022."
    },
    {
      "date": "1843-04-28T00:00:00",
      "claimants": "Millerites",
      "description": "Although it was not officially endorsed by their leadership, many Millerites expected the Second Coming to occur on 28\u0026nbsp;April or at the end of 1843."
    },
    {
      "date": "1843-12-31T00:00:00",
      "claimants": "Millerites",
      "description": "Although it was not officially endorsed by their leadership, many Millerites expected the Second Coming to occur on 28\u0026nbsp;April or at the end of 1843."
    },
    {
      "date": "1843-01-01T00:00:00",
      "claimants": "Harriet\u0026nbsp;Livermore",
      "description": "The first of two years this preacher predicted the world would end."
    },
    {
      "date": "1844-03-21T00:00:00",
      "claimants": "William Miller",
      "description": "Miller, a Baptist preacher, predicted Christ would return on this day."
    },
    {
      "date": "1844-10-22T00:00:00",
      "claimants": "Millerites",
      "description": "After Christ did not return on 21\u0026nbsp;March 1844, the Millerites then revised William Miller\u0027s prediction to 22\u0026nbsp;October the same year, claiming to have miscalculated Scripture. The realization that the predictions were incorrect resulted in the Great Disappointment."
    },
    {
      "date": "1847-08-07T00:00:00",
      "claimants": "George Rapp",
      "description": "Rapp, the founder of the Harmony Society, preached that Jesus would return in his lifetime, even as he lay dying on 7\u0026nbsp;August 1847."
    },
    {
      "date": "1847-01-01T00:00:00",
      "claimants": "Harriet Livermore",
      "description": "The second prediction of the end of the world from this preacher."
    },
    {
      "date": "1862-01-01T00:00:00",
      "claimants": "John Cumming",
      "description": "This Scottish clergyman stated it was 6,000 years since creation in 1862, and that the world would end."
    },
    {
      "date": "1862-01-01T00:00:00",
      "claimants": "Joseph Morris",
      "description": "An English convert to Mormonism, Morris had revelations to gather his followers and wait for the Second Coming, through successive prophesied days."
    },
    {
      "date": "1863-01-01T00:00:00",
      "claimants": "John Wroe",
      "description": "The founder of the Christian Israelite Church calculated that the Millennium would begin this year."
    },
    {
      "date": "1873-01-01T00:00:00",
      "claimants": "Jonas Wendell",
      "description": "In 1870, Wendell published his views in the booklet entitled The Present Truth, or Meat in Due Season concluding that the Second Advent was sure to occur in 1873."
    },
    {
      "date": "1874-01-01T00:00:00",
      "claimants": "Charles Taze Russell",
      "description": "This Christian minister predicted the return of Jesus to occur in 1874, and after this date reinterpreted the prediction to say that Jesus had indeed returned in invisible form."
    },
    {
      "date": "1881-01-01T00:00:00",
      "claimants": "Mother Shipton (attrib.)",
      "description": "This 15th-century prophet was quoted as saying \u0022The world to an end shall come, In eighteen hundred and eighty one\u0022 in a book published in 1862. In 1873 it was revealed to be a forgery; however, this did not stop some people from expecting the end."
    },
    {
      "date": "1890-01-01T00:00:00",
      "claimants": "Wovoka",
      "description": "The founder of the Ghost Dance movement predicted in 1889 that the Millennium would occur in 1890."
    },
    {
      "date": "1901-01-01T00:00:00",
      "claimants": "Catholic Apostolic Church",
      "description": "Founded in 1831, this church claimed that Jesus would return by the time the last of its 12 founding members died. The last member died in 1901."
    },
    {
      "date": "1901-01-01T00:00:00",
      "claimants": "Annie Keeler",
      "description": "Keeler, a prominent doctor in Connecticut, predicted that due to the alignment of the planets, the world would come to an end and \u0022complete the planetary cycle as it was in the days of Noah\u0022."
    },
    {
      "date": "1908-04-23T00:00:00",
      "claimants": "Michael Paget Baxter",
      "description": "The last of numerous apocalyptic predictions by this Anglican evangelist and author; this prediction was published in 1894."
    },
    {
      "date": "1910-01-01T00:00:00",
      "claimants": "Camille Flammarion",
      "description": "Flammarion predicted that the 1910 appearance of Halley\u0027s Comet \u0022would impregnate that atmosphere and possibly snuff out all life on the planet\u0022 but not the planet itself. \u0022Comet pills\u0022 were sold to protect against toxic gases."
    },
    {
      "date": "1911-01-01T00:00:00",
      "claimants": "Charles Piazzi Smyth",
      "description": "This pyramidologist concluded from his research on the dimensions of the Great Pyramid of Giza that the Second Coming would occur somewhere between 1892 and 1911."
    },
    {
      "date": "1914-01-01T00:00:00",
      "claimants": "Charles Taze Russell",
      "description": "Russell said \u0022...the battle of the great day of God Almighty... The date of the close of that \u0027battle\u0027 is definitely marked in Scripture as October 1914. It is already in progress, its beginning dating from October, 1874.\u0022"
    },
    {
      "date": "1915-01-01T00:00:00",
      "claimants": "John Chilembwe",
      "description": "This Baptist educator and leader of a rebellion in the British protectorate of Nyasaland predicted the Millennium would begin this year."
    },
    {
      "date": "1918-01-01T00:00:00",
      "claimants": "International Bible Students\u0026nbsp;Association",
      "description": "\u0022Christendom shall be cut off and glorification of the Little Flock (The Church) in the Spring of 1918 A. D.\u0022"
    },
    {
      "date": "1920-01-01T00:00:00",
      "claimants": "International Bible Students Association",
      "description": "In 1918, Christendom would go down as a system to oblivion and be succeeded by revolutionary governments. God would \u0022destroy the churches wholesale and the church members by the millions.\u0022 Church members would \u0022perish by the sword of war, revolution and anarchy.\u0022 The dead would lie unburied. In 1920 all earthly governments would disappear, with worldwide anarchy prevailing."
    },
    {
      "date": "1925-02-13T00:00:00",
      "claimants": "Margaret Rowen",
      "description": "According to this Seventh-Day Adventist, the angel Gabriel appeared before her in a vision and told her that the world would end at midnight on this date."
    },
    {
      "date": "1926-01-01T00:00:00",
      "claimants": "Spencer Perceval",
      "description": "This British MP, who was one of the 12 apostles of the Catholic Apostolic Church, believed that the world was growing nearer to the Apocalypse due to what he viewed as the rampant immorality of the times in Europe."
    },
    {
      "date": "1935-09-01T00:00:00",
      "claimants": "Wilbur Glenn Voliva",
      "description": "This evangelist announced that \u0022the world is going to go \u0027puff\u0027 and disappear\u0022 in September 1935."
    },
    {
      "date": "1936-01-01T00:00:00",
      "claimants": "Herbert W. Armstrong",
      "description": "The founder of the Worldwide Church of God told members of his church that the Rapture was to take place in 1936, and that only they would be saved. After the prophecy failed, he changed the date three more times."
    },
    {
      "date": "1941-01-01T00:00:00",
      "claimants": "Jehovah\u0027s Witnesses",
      "description": "A prediction of the end from the Jehovah\u0027s Witnesses, a group that branched from the Bible Student movement."
    },
    {
      "date": "1943-01-01T00:00:00",
      "claimants": "Herbert W. Armstrong",
      "description": "The first of three revised dates from Armstrong after his 1936 prediction failed to come true."
    },
    {
      "date": "1947-01-01T00:00:00",
      "claimants": "John Ballou Newbrough",
      "description": "The author of Oahspe: A New Bible foresaw the destruction of all nations and the beginning of post-apocalyptic anarchy in this year."
    },
    {
      "date": "1954-12-21T00:00:00",
      "claimants": "Dorothy Martin",
      "description": "The world was to be destroyed by terrible flooding on this date, claimed this leader of a UFO cult called Brotherhood of the Seven Rays. The fallout of the group after the prediction failed was the basis for the 1956 book When Prophecy Fails."
    },
    {
      "date": "1959-04-22T00:00:00",
      "claimants": "Florence Houteff",
      "description": "The second prophet of the Branch Davidians predicted the apocalypse foretold in the Book of Revelation would proceed on this date. The failure of the prophecy led to the split of the sect into several subsects, the most prominent led by Benjamin and Lois Roden."
    },
    {
      "date": "1962-02-04T00:00:00",
      "claimants": "Jeane Dixon, various Indian astrologers",
      "description": "Dixon predicted a planetary alignment on this day was to bring destruction to the world. Mass prayer meetings were held in India."
    },
    {
      "date": "1967-08-20T00:00:00",
      "claimants": "George Van Tassel",
      "description": "This day would mark the beginning of the third woe of the Apocalypse, during which the southeastern US would be destroyed by a Soviet nuclear attack, according to this UFO prophet, who claimed to have channeled an alien named Ashtar."
    },
    {
      "date": "1967-01-01T00:00:00",
      "claimants": "Jim Jones",
      "description": "The founder of the People\u0027s Temple stated he had visions that a nuclear holocaust was to take place in 1967."
    },
    {
      "date": "1969-08-09T00:00:00",
      "claimants": "George Williams",
      "description": "The founder of the Church of the Firstborn predicted the Second Coming of Christ would occur on this day."
    },
    {
      "date": "1969-01-01T00:00:00",
      "claimants": "Charles Manson",
      "description": "Manson predicted that Helter skelter, an apocalyptic race war, would occur in 1969."
    },
    {
      "date": "1972-01-01T00:00:00",
      "claimants": "Herbert W. Armstrong",
      "description": "The second of three revised dates from Armstrong after his 1936 and 1943 predictions failed to come true."
    },
    {
      "date": "1974-01-01T00:00:00",
      "claimants": "David Berg",
      "description": "Berg, the leader of Children of God, predicted that there would be a colossal doomsday event heralded by Comet Kohoutek."
    },
    {
      "date": "1975-01-01T00:00:00",
      "claimants": "Herbert W. Armstrong",
      "description": "Armstrong\u0027s fourth and final prediction."
    },
    {
      "date": "1975-01-01T00:00:00",
      "claimants": "Jehovah\u0027s Witnesses",
      "description": "From 1966 on, Jehovah\u0027s Witnesses published articles stating that the fall of 1975 would be 6,000 years since man\u0027s creation and suggested that Armageddon could be finished by then."
    },
    {
      "date": "1976-01-01T00:00:00",
      "claimants": "Brahma Kumaris",
      "description": "The Brahma Kumaris founder, Lekhraj Kirpalani, has made a number of predictions of a global Armageddon which the religion believes it will inspire, internally calling it \u0022Destruction\u0022. During Destruction, Brahma Kumari leaders teach the world will be purified, all of the rest of humanity killed by nuclear or civil wars and natural disasters which will include the sinking of all other continents except India."
    },
    {
      "date": "1977-01-01T00:00:00",
      "claimants": "John Wroe",
      "description": "The founder of the Christian Israelite Church predicted this year for Armageddon to occur."
    },
    {
      "date": "1977-01-01T00:00:00",
      "claimants": "William M. Branham",
      "description": "This Christian minister predicted the Rapture would occur no later than 1977."
    },
    {
      "date": "1980-01-01T00:00:00",
      "claimants": "Leland Jensen",
      "description": "Jensen predicted in 1978 that there would be a nuclear disaster in 1980, followed by two decades of conflict, culminating in God\u0027s Kingdom being established on Earth."
    },
    {
      "date": "1981-01-01T00:00:00",
      "claimants": "Chuck Smith",
      "description": "The founder of Calvary Chapel predicted that the generation of 1948 would be the last generation and the world would end by 1981. Smith said that he \u0022could be wrong\u0022 but added that his prediction was \u0022a deep conviction in my heart, and all my plans are predicated upon that belief.\u0022"
    },
    {
      "date": "1982-06-01T00:00:00",
      "claimants": "Tara Centers",
      "description": "Full-page adverts in many newspapers dated 24 and 25\u0026nbsp;April 1982 stated that \u0022The Christ is Now Here!\u0022 and that he would make himself known \u0022within the next two months\u0022."
    },
    {
      "date": "1982-03-10T00:00:00",
      "claimants": "John Gribbin, Stephen Plagemann",
      "description": "Gribbin, an astrophysicist, co-authored the 1974 book The Jupiter Effect which predicted that combined gravitational forces of aligned planets would create a number of catastrophes, including a great earthquake on the San Andreas Fault."
    },
    {
      "date": "1982-06-21T00:00:00",
      "claimants": "Benjamin Creme",
      "description": "Creme took out an ad in the Los Angeles Times stating that the Second Coming would occur in June 1982, and the Maitreya announced it on worldwide television."
    },
    {
      "date": "1982-01-01T00:00:00",
      "claimants": "Pat Robertson",
      "description": "In late 1976, Robertson predicted on his The 700 Club TV programme that the end of the world would come in this year."
    },
    {
      "date": "1985-01-01T00:00:00",
      "claimants": "Lester Sumrall",
      "description": "This Pentecostal minister predicted the end of the world in this year, even writing a book about it entitled I Predict 1985."
    },
    {
      "date": "1986-04-29T00:00:00",
      "claimants": "Leland Jensen",
      "description": "Jensen predicted that Halley\u0027s Comet would be pulled into Earth\u0027s orbit on this day, causing widespread destruction."
    },
    {
      "date": "1987-08-17T00:00:00",
      "claimants": "José Argüelles",
      "description": "Argüelles claimed that Armageddon would happen unless 144,000 people gathered in certain places across the world in order to \u0022resonate in harmony\u0022 on this day."
    },
    {
      "date": "1988-09-13T00:00:00",
      "claimants": "Edgar C. Whisenant",
      "description": "Whisenant predicted in his book 88 Reasons Why the Rapture Could Be in 1988 that the Rapture of the Christian Church would occur between 11 and 13\u0026nbsp;September 1988. After this prediction failed to come true, Whisenant revised his prediction date to 3\u0026nbsp;October."
    },
    {
      "date": "1988-10-03T00:00:00",
      "claimants": "Edgar C. Whisenant",
      "description": "Whisenant predicted in his book 88 Reasons Why the Rapture Could Be in 1988 that the Rapture of the Christian Church would occur between 11 and 13\u0026nbsp;September 1988. After this prediction failed to come true, Whisenant revised his prediction date to 3\u0026nbsp;October."
    },
    {
      "date": "1989-09-30T00:00:00",
      "claimants": "Edgar C. Whisenant",
      "description": "After all his 1988 predictions failed to come true, Whisenant revised his prediction date to this day."
    },
    {
      "date": "1990-04-23T00:00:00",
      "claimants": "Elizabeth Clare Prophet",
      "description": "Prophet predicted a nuclear war would start on this day, and the world would end 12 years later, leading her followers to stockpile a shelter with supplies and weapons. After Prophet\u0027s prediction did not come to pass, she was later diagnosed with epilepsy and Alzheimer\u0027s disease."
    },
    {
      "date": "1991-09-09T00:00:00",
      "claimants": "Menachem Mendel Schneerson",
      "description": "This Russian-born rabbi called for the Messiah to come by the start of the Jewish New Year."
    },
    {
      "date": "1991-01-01T00:00:00",
      "claimants": "Louis Farrakhan",
      "description": "The leader of the Nation of Islam declared that the Gulf War would be the \u0022War of Armageddon which is the final war\u0022."
    },
    {
      "date": "1992-09-28T00:00:00",
      "claimants": "Rollen Stewart",
      "description": "This born-again Christian predicted the Rapture would take place on this day."
    },
    {
      "date": "1992-10-28T00:00:00",
      "claimants": "Lee Jang Rim\n(이장림 or 李長林)",
      "description": "Lee, the leader of the Dami Mission church, predicted the rapture would occur on this day."
    },
    {
      "date": "1993-01-01T00:00:00",
      "claimants": "David Berg",
      "description": "Berg predicted the tribulation would start in 1989 and that the Second Coming would take place in 1993."
    },
    {
      "date": "1993-01-01T00:00:00",
      "claimants": "Edgar C. Whisenant",
      "description": "After his 1988 and 1989 predictions failed, Whisenant moved the outer limit of his prediction to 1993."
    },
    {
      "date": "1994-01-01T00:00:00",
      "claimants": "Edgar C. Whisenant",
      "description": "When his 1993 prediction failed to materialize, Whisenant updated it to 1994."
    },
    {
      "date": "1994-05-02T00:00:00",
      "claimants": "Neal Chase",
      "description": "This Bahá\u0027í sect leader predicted that New York City would be destroyed by a nuclear bomb on 23\u0026nbsp;March 1994, and the Battle of Armageddon would take place 40 days later."
    },
    {
      "date": "1994-09-29T00:00:00",
      "claimants": "Harold Camping",
      "description": "Camping predicted the Rapture would occur on 6\u0026nbsp;September 1994. When it failed to occur he revised the date to 29\u0026nbsp;September and then 2\u0026nbsp;October."
    },
    {
      "date": "1995-03-31T00:00:00",
      "claimants": "Harold Camping",
      "description": "Camping\u0027s fourth predicted date for the end. This would be Camping\u0027s last prediction until 2011."
    },
    {
      "date": "1996-12-17T00:00:00",
      "claimants": "Sheldan Nidle",
      "description": "Nidle, a Californian psychic, predicted that the world would end on this date, with the arrival of 16\u0026nbsp;million space ships and a host of angels."
    },
    {
      "date": "1997-03-26T00:00:00",
      "claimants": "Marshall Applewhite",
      "description": "Applewhite, leader of the Heaven\u0027s Gate cult, claimed that a spacecraft was trailing the Comet Hale-Bopp and argued that suicide was \u0022the only way to evacuate this Earth\u0022 so that the cult members\u0027 souls could board the supposed craft and be taken to another \u0022level of existence above human\u0022. Applewhite and 38 of his followers committed mass suicide."
    },
    {
      "date": "1997-10-23T00:00:00",
      "claimants": "James Ussher",
      "description": "This 17th-century Irish archbishop predicted this date to be 6,000 years since creation and therefore the end of the world."
    },
    {
      "date": "1998-03-31T00:00:00",
      "claimants": "Hon-Ming Chen",
      "description": "Chen, leader of the Taiwanese cult Chen Tao\u0026nbsp;– \u0022The True Way\u0022\u0026nbsp;– claimed that God would come to Earth in a flying saucer at 10:00\u0026nbsp;am on this date."
    },
    {
      "date": "1999-07-01T00:00:00",
      "claimants": "Nostradamus",
      "description": "A quatrain by Nostradamus that stated the \u0022King of Terror\u0022 would come from the sky in \u00221999 and seven months\u0022 was frequently interpreted as a prediction of doomsday in July 1999."
    },
    {
      "date": "1999-08-18T00:00:00",
      "claimants": "The Amazing Criswell",
      "description": "The predicted date of the end of the world, according to this psychic well known for predictions."
    },
    {
      "date": "1999-09-11T00:00:00",
      "claimants": "Philip Berg",
      "description": "Berg, dean of the worldwide Kabbalah Centre, stated that on this date \u0022a ball of fire will descend, destroying almost all of mankind, all vegetation, all forms of life.\u0022"
    },
    {
      "date": "1999-01-01T00:00:00",
      "claimants": "Charles Berlitz",
      "description": "This linguist predicted the end would occur in this year. He did not predict how it would happen, stating that it might involve nuclear devastation, asteroid impact, pole shift or other Earth changes."
    },
    {
      "date": "1999-01-01T00:00:00",
      "claimants": "Hon-Ming Chen",
      "description": "The leader of the cult Chen Tao preached that a nuclear holocaust would destroy Europe and Asia in 1999."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "James Gordon Lindsay",
      "description": "This preacher predicted the great tribulation would begin before 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Timothy\u0026nbsp;Dwight\u0026nbsp;IV",
      "description": "This 19th-century president of Yale University foresaw Christ\u0027s Millennium starting by 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Nazim Al-Haqqani",
      "description": "This Sufi Muslim sheikh predicted that the Last Judgment would occur before 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Peter Olivi",
      "description": "This 13th-century theologian wrote that the Antichrist would come to power between 1300 and 1340, and the Last Judgement would take place around 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Isaac Newton",
      "description": "Newton predicted that Christ\u0027s Millennium would begin in 2000 in his book Observations upon the Prophecies of Daniel, and the Apocalypse of St. John."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Ruth Montgomery",
      "description": "This self-described Christian psychic predicted the Earth\u0027s axis would shift and the Antichrist would reveal himself in this year."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Edgar Cayce",
      "description": "This psychic predicted the Second Coming would occur this year."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Sun Myung Moon",
      "description": "The founder of the Unification Church predicted the Kingdom of Heaven would be established in this year."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Ed Dobson",
      "description": "This pastor predicted the end would occur in his book The End: Why Jesus Could Return by A.D. 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Lester Sumrall",
      "description": "This minister predicted the end in his book I Predict 2000."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Jonathan Edwards",
      "description": "This 18th-century preacher predicted that Christ\u0027s thousand-year reign would begin in this year."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Various",
      "description": "During and before 1999, there were widespread predictions of a computer bug that would crash many computers at midnight on 1\u0026nbsp;January\u0026nbsp;2000, causing malfunctions that would lead to major catastrophes worldwide, and that society would cease to function."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Credonia Mwerinde, Joseph Kibweteere",
      "description": "An estimated 778 followers of the Movement for the Restoration of the Ten Commandments of God perished in a devastating fire and a series of poisonings and killings that were either a group suicide or an orchestrated mass murder by group leaders after their predictions of the apocalypse failed to come about."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Jerry Falwell",
      "description": "Falwell foresaw God pouring out his judgement on the world on this day."
    },
    {
      "date": "2000-01-01T00:00:00",
      "claimants": "Tim LaHaye,Jerry B. Jenkins",
      "description": "These Christian authors claimed that the Y2K bug would trigger global economic chaos, which the Antichrist would use to rise to power. As the date approached, however, they changed their minds."
    },
    {
      "date": "2000-04-06T00:00:00",
      "claimants": "James Harmston",
      "description": "The leader of the True and Living Church of Jesus Christ of Saints of the Last Days predicted the Second Coming of Christ would occur on this day."
    },
    {
      "date": "2000-05-05T00:00:00",
      "claimants": "Nuwaubian Nation",
      "description": "This movement claimed that the planetary lineup would cause a \u0022star holocaust\u0022, pulling the planets toward the Sun on this day."
    },
    {
      "date": "2001-01-01T00:00:00",
      "claimants": "Tynnetta Muhammad",
      "description": "This columnist for the Nation of Islam predicted the end would occur in this year."
    },
    {
      "date": "2003-05-27T00:00:00",
      "claimants": "Nancy Lieder",
      "description": "Lieder originally predicted the date for the Nibiru collision as May 2003. According to her website, aliens in the Zeta Reticuli star system told her through messages via a brain implant of a planet which would enter the Solar System and cause a pole shift on Earth that would destroy most of humanity."
    },
    {
      "date": "2003-11-29T00:00:00",
      "claimants": "Aum Shinrikyo",
      "description": "This Japanese cult, which carried out the Tokyo subway sarin attack in 1995, predicted the world would be destroyed by a nuclear war between 30\u0026nbsp;October and 29\u0026nbsp;November 2003."
    },
    {
      "date": "2006-09-12T00:00:00",
      "claimants": "House of Yahweh",
      "description": "Yisrayl Hawkins, pastor and overseer of The House of Yahweh, predicted in his February 2006 newsletter that a nuclear war would begin on 12\u0026nbsp;September 2006."
    },
    {
      "date": "2007-04-29T00:00:00",
      "claimants": "Pat Robertson",
      "description": "In his 1990 book The New Millennium, Robertson suggests this date as the day of Earth\u0027s destruction."
    },
    {
      "date": "2007-05-01T00:00:00",
      "claimants": "Pyotr Kuznetsov",
      "description": "The founder of the True Russian Orthodox Church predicted doomsday would occur this month. Kuznetsov and his followers hid in a cave in anticipation of the end, and Kuznetsov attempted suicide after his prediction failed to come true."
    },
    {
      "date": "2010-01-01T00:00:00",
      "claimants": "Hermetic Order of the Golden Dawn",
      "description": "This magical organization, which existed from 1887 to 1903, predicted the world would end during this year."
    },
    {
      "date": "2011-05-21T00:00:00",
      "claimants": "Harold Camping",
      "description": "Camping predicted that the Rapture and devastating earthquakes would occur on this date, with God taking approximately 3% of the world\u0027s population into Heaven, and that the end of the world would occur five months later on 21\u0026nbsp;October."
    },
    {
      "date": "2011-09-29T00:00:00",
      "claimants": "Ronald Weinland",
      "description": "Weinland, the founder of the Church of God Preparing for the Kingdom of God, stated Jesus would return on this day. After his prophecy failed to come true he changed the date to 27\u0026nbsp;May 2012."
    },
    {
      "date": "2011-10-21T00:00:00",
      "claimants": "Harold Camping",
      "description": "When his original prediction failed to come true five months earlier, Camping revised his prediction by saying that on 21\u0026nbsp;May a \u0022Spiritual Judgment\u0022 had taken place, and both the physical Rapture and the end of the world would occur on 21\u0026nbsp;October 2011."
    },
    {
      "date": "2011-10-01T00:00:00",
      "claimants": "Various",
      "description": "There were fears amongst the public that Comet Elenin travelling almost directly between Earth and the Sun would cause disturbances to the Earth\u0027s crust, causing massive earthquakes and tidal waves. Others predicted that Elenin would collide with Earth on 16\u0026nbsp;October. Scientists stated that none of these events were possible in an effort to calm the public."
    },
    {
      "date": "2012-05-27T00:00:00",
      "claimants": "Ronald Weinland",
      "description": "Weinland\u0027s revised date for the return of Jesus following the failure of his 2011 prediction."
    },
    {
      "date": "2012-06-30T00:00:00",
      "claimants": "José Luis de Jesús",
      "description": "This cult leader predicted that the world\u0027s governments and economies would fail on this day, and that he and his followers would undergo a transformation that would allow them to fly and walk through walls."
    },
    {
      "date": "2012-12-21T00:00:00",
      "claimants": "Various",
      "description": "The 2012 phenomenon predicted the world would end at the end of the 13th b\u0027ak\u0027tun. The Earth would be destroyed by an asteroid, Nibiru, or some other interplanetary object; an alien invasion; or a supernova. Mayanist scholars stated that no extant classic Maya accounts forecasted impending doom, and that the idea that the Long Count calendar ends in 2012 misrepresented Maya history and culture. Scientists from NASA, along with expert archeologists, stated that none of those events were possible."
    },
    {
      "date": "2013-08-23T00:00:00",
      "claimants": "Grigori Rasputin",
      "description": "Rasputin, a Russian mystic who died in 1916, prophesied a storm would take place on this day where fire would destroy most life on land and Jesus would come back to Earth to comfort those in distress."
    },
    {
      "date": "2015-09-01T00:00:00",
      "claimants": "John Hagee,Mark Biltz",
      "description": "The so-called blood moon prophecy, first predicted by Mark Blitz in 2008 and then by John Hagee in 2014. These Christian ministers claim that the tetrad in 2014 and 2015 may represent the beginning of the Messianic end times."
    },
    {
      "date": "2017-10-15T00:00:00",
      "claimants": "David Meade",
      "description": "Conspiracy theorist David Meade predicted that Nibiru would become visible in the sky and would \u0022soon\u0022 destroy the Earth."
    },
    {
      "date": "2018-04-23T00:00:00",
      "claimants": "David Meade",
      "description": "After his 2017 prediction failed, Meade predicted the rapture would take place and that the world would end on this date."
    },
    {
      "date": "2019-06-09T00:00:00",
      "claimants": "Ronald Weinland",
      "description": "Weinland had previously predicted the world would end in 2011, and then 2012."
    },
    {
      "date": "2020-01-01T00:00:00",
      "claimants": "Jeane Dixon",
      "description": "Dixon predicted that Armageddon would take place in 2020. She had previously predicted the world would end on 4\u0026nbsp;February 1962."
    },
    {
      "date": "2021-01-01T00:00:00",
      "claimants": "F. Kenton Beshore",
      "description": "This American pastor based his prediction on the prior suggestion that Jesus would return in 1988, i.e., within one biblical generation (40 years) of the founding of Israel in 1948. Beshore argued that the prediction was correct, but that the definition of a biblical generation was incorrect and was actually 70–80 years, placing the second coming of Jesus between 2018 and 2028 and the rapture by 2021 at the latest."
    },
    {
      "date": "2025-09-24T00:00:00",
      "claimants": "Joshua Mhlakela and various TikTok users",
      "description": "South African pastor Joshua Mhlakela prophesied the Biblical Rapture where Jesus ascending true believers to heaven before global tribulation, leading to the hashtag #RaptureTok on TikTok with videos amassing millions of views on tips like survival kits for those \u0022left behind\u0022 and historical context of repeated failed predictions."
    },
    {
      "date": "2026-01-01T00:00:00",
      "claimants": "Messiah Foundation International",
      "description": "In accordance with the predictions in Riaz Ahmed Gohar Shahi\u0027s book The Religion of God, this spiritual organisation believes that the world will end when an asteroid collides with Earth in 2026."
    },
    {
      "date": "2060-01-01T00:00:00",
      "claimants": "Isaac Newton (attrib.)",
      "description": "In an unpublished manuscript, Newton made a reference to the year 2060, which in 2004 was falsely reported by mainstream media as a date for the end of the world. Newton was actually predicting a date before which the world would definitely not end, in order to calm people\u0027s fears about the apocalypse."
    },
    {
      "date": "2129-01-01T00:00:00",
      "claimants": "Said Nursi",
      "description": "According to this Sunni Muslim theologian, the world will end in 2129."
    },
    {
      "date": "2239-01-01T00:00:00",
      "claimants": "Talmud, Orthodox Judaism",
      "description": "According to an opinion about the Talmud in mainstream Orthodox Judaism, the Messiah will come within 6,000 years of the creation of Adam, and the world may be destroyed 1,000 years later. This would put the beginning of the period of desolation in 2239\u0026nbsp;CE and the end of the period of desolation in 3239\u0026nbsp;CE."
    },
    {
      "date": "2280-01-01T00:00:00",
      "claimants": "Rashad Khalifa",
      "description": "According to this Egyptian-American biochemist\u0027s research on the Quran, the world will end in 2280."
    }
  ]